{"keras_version": "1.2.1", "config": [{"config": {"name": "convolution2d_1", "nb_filter": 10, "W_constraint": null, "dim_ordering": "tf", "batch_input_shape": [null, 32, 32, 3], "nb_row": 8, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "input_dtype": "float32", "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "nb_col": 8, "b_constraint": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "averagepooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "AveragePooling2D"}, {"config": {"W_constraint": null, "nb_filter": 64, "activity_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_row": 8, "activation": "linear", "W_regularizer": null, "trainable": true, "bias": true, "name": "convolution2d_2", "subsample": [1, 1], "b_regularizer": null, "nb_col": 8, "b_constraint": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "name": "averagepooling2d_2", "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "activity_regularizer": null, "input_dim": 256, "output_dim": 500, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_constraint": null, "activity_regularizer": null, "input_dim": 500, "output_dim": 43, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential"}