{"config": [{"config": {"border_mode": "valid", "name": "convolution2d_1", "input_dtype": "float32", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "batch_input_shape": [null, 32, 32, 3], "bias": true, "subsample": [1, 1], "W_constraint": null, "nb_col": 8, "nb_filter": 64, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 8, "trainable": true, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "name": "averagepooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf"}, "class_name": "AveragePooling2D"}, {"config": {"border_mode": "valid", "name": "convolution2d_2", "dim_ordering": "tf", "activation": "linear", "init": "glorot_uniform", "nb_row": 8, "bias": true, "subsample": [1, 1], "W_constraint": null, "nb_col": 8, "nb_filter": 64, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "name": "averagepooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf"}, "class_name": "AveragePooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "output_dim": 500, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dim": 256}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dense_2", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "output_dim": 43, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dim": 500}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_4", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.2.1", "class_name": "Sequential"}