{"config": [{"config": {"input_dtype": "float32", "border_mode": "valid", "b_regularizer": null, "nb_filter": 64, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_1", "W_constraint": null, "nb_col": 8, "init": "glorot_uniform", "W_regularizer": null, "bias": true, "batch_input_shape": [null, 32, 32, 3], "activation": "linear", "nb_row": 8, "trainable": true, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "strides": [2, 2], "name": "averagepooling2d_1", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "AveragePooling2D"}, {"config": {"bias": true, "b_regularizer": null, "nb_filter": 64, "b_constraint": null, "dim_ordering": "tf", "nb_row": 8, "W_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "name": "convolution2d_2", "trainable": true, "activity_regularizer": null, "subsample": [1, 1], "nb_col": 8}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "strides": [2, 2], "name": "averagepooling2d_2", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias": true, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "name": "dense_1", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "input_dim": 256, "output_dim": 500, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "name": "dense_2", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "input_dim": 500, "output_dim": 43, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "1.2.1", "class_name": "Sequential"}